
////////////////////////////////////////////////////////////////////////
// ОРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Элемент = Элементы.Добавить("Таблица", Тип("ТаблицаФормы"), Элементы.ГруппаТаблицы);
    Элемент.ПутьКДанным = "Таблица";
    
    лТаблица        = ДанныеФормыВЗначение(Таблица         , Тип("ТаблицаЗначений"));
    РедакторКолонок = ДанныеФормыВЗначение(ОписаниеКолонок , Тип("ТаблицаЗначений"));
    
    ПараметрТаблицаЗначений = Неопределено;
	ПараметрАдрес = "";
	Отбор = Неопределено;
    Если Параметры.Свойство("ПараметрТаблицаЗначений", ПараметрТаблицаЗначений) Тогда

		Если ТипЗнч(ПараметрТаблицаЗначений) = Тип("Строка") Тогда
			Попытка
				ПараметрТаблицаЗначений = ЗначениеИзСтрокиВнутр(ПараметрТаблицаЗначений);
			Исключение
				ПараметрТаблицаЗначений = ПолучитьИзВременногоХранилища(ПараметрТаблицаЗначений);
			КонецПопытки; 
        КонецЕсли; 

        Если ТипЗнч(ПараметрТаблицаЗначений) = Тип("ТаблицаЗначений") Тогда
            лТаблица = ПараметрТаблицаЗначений;
            ВывестиКолонкиВРедактор(РедакторКолонок, лТаблица.Колонки);
            Для каждого Колонка Из лТаблица.Колонки Цикл
                ДобавитьКолонку(Колонка.Имя, Колонка.ТипЗначения);
			КонецЦикла; 
		КонецЕсли;
		
	// вызов из строки пакета
	ИначеЕсли Параметры.Свойство("ПараметрАдрес", ПараметрАдрес) И НЕ ПустаяСтрока(ПараметрАдрес) Тогда
		
		пХранилище = ПолучитьИзВременногоХранилища(Параметры.ОбъектПутьКХранилищу);
		СтруктураТЗ = пХранилище.СтруктураТЗ;
		
		ТаблицаПакетов = пХранилище.ТаблицаПакетов;
		Отбор = Новый Структура("Адрес", ПараметрАдрес);
		МассивСтрок = ТаблицаПакетов.НайтиСтроки(Отбор);
		Если МассивСтрок.Количество() = 0 Тогда
			Возврат;
		Иначе
		     Строка = МассивСтрок[0];
			 ТекстовыйДокумент.УстановитьТекст(Строка.ТекстМодуля);
		КонецЕсли; 
		
		Если НЕ СтруктураТЗ.Свойство(ПараметрАдрес) Тогда
			Отказ = Истина;
		КонецЕсли;
		
		лТаблица = СтруктураТЗ[ПараметрАдрес];
		ВывестиКолонкиВРедактор(РедакторКолонок, лТаблица.Колонки);
		Для каждого Колонка Из лТаблица.Колонки Цикл
			ДобавитьКолонку(Колонка.Имя, Колонка.ТипЗначения);
		КонецЦикла; 
		
	ИначеЕсли Параметры.Свойство("ПутьКРезультатуЗапроса", Отбор) Тогда
		
		пХранилище = ПолучитьИзВременногоХранилища(Параметры.ОбъектПутьКХранилищу);
		РезультатЗапроса = пХранилище.СтруктурыРезультатовЗапросовТабДоков[Отбор.ИмяТабДокумента][Отбор.ИмяВыборки];
		
		лТаблица = РезультатЗапроса.Выгрузить();
		
		ВывестиКолонкиВРедактор(РедакторКолонок, лТаблица.Колонки);
		Для каждого Колонка Из лТаблица.Колонки Цикл
			ДобавитьКолонку(Колонка.Имя, Колонка.ТипЗначения);
		КонецЦикла; 
		
	ИначеЕсли Параметры.Свойство("ОтборПараметрЗапроса", Отбор) Тогда
		
		пХранилище = ПолучитьИзВременногоХранилища(Параметры.ОбъектПутьКХранилищу);
		ТабПараметров = пХранилище.ТабПараметров;
		
		Строкапараметра = ТабПараметров.НайтиСтроки(Отбор)[0];

		лТаблица = Строкапараметра.Значение;
		
		Если НЕ ТипЗнч(лТаблица) = тип("ТаблицаЗначений") Тогда
			лТаблица = Новый ТаблицаЗначений;
		КонецЕсли; 
		
		ВывестиКолонкиВРедактор(РедакторКолонок, лТаблица.Колонки);
		Для каждого Колонка Из лТаблица.Колонки Цикл
			ДобавитьКолонку(Колонка.Имя, Колонка.ТипЗначения);
		КонецЦикла; 
		
	КонецЕсли;
	
	ЗначениеВДанныеФормы(лТаблица        , Таблица        );
	ЗначениеВДанныеФормы(РедакторКолонок , ОписаниеКолонок);
	
	Элементы.ГруппаРедактораКолонок.Видимость = Ложь;

	СисИнфо = Новый СистемнаяИнформация;
	Объект.ВерсияПриложения = СисИнфо.ВерсияПриложения;
	
	Если Лев(Объект.ВерсияПриложения, 3) = "8.2" Тогда
		Объект.МодальностьРазрешена = Истина;
	Иначе
		РежимИспользованияМодальности = Метаданные["РежимИспользованияМодальности"];
		РежимИспользованияМодальности_Использовать = Метаданные["СвойстваОбъектов"].РежимИспользованияМодальности.Использовать;
		Объект.МодальностьРазрешена = РежимИспользованияМодальности = РежимИспользованияМодальности_Использовать;
	КонецЕсли;
    
КонецПроцедуры


////////////////////////////////////////////////////////////////////////
// ОРАБОТЧИКИ СОБЫТИЙ КОМАНДНОЙ ПАНЕЛИ ФОРМЫ

&НаКлиенте
Процедура ЗагрузитьТаблицуИзФайла(Команда)

	Перем ВыбранноеИмя; 
	Перем АдресВременногоХранилища; 
	
	Если Объект.МодальностьРазрешена Тогда
		ТекстКода = "
		|Если ПоместитьФайл(АдресВременногоХранилища, ВыбранноеИмя, ВыбранноеИмя, Истина, УникальныйИдентификатор) Тогда 
		|	ЗагрузитьТаблицуИзФайлаЗавершение(Истина, АдресВременногоХранилища); 
		|КонецЕсли;";
	Иначе
		ТекстКода = "
		|Оповещение = Новый ОписаниеОповещения(""ЗагрузитьТаблицуИзФайлаЗавершение"", ЭтаФорма, Истина);
		|НачатьПомещениеФайла(Оповещение, АдресВременногоХранилища, ВыбранноеИмя, Истина, УникальныйИдентификатор);";
	КонецЕсли;
	
	Выполнить(ТекстКода);

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТаблицуИзФайлаЗавершение(Заглушка = Неопределено, АдресВременногоХранилища = Неопределено, ИмяФайла = Неопределено, Параметры = Неопределено) Экспорт
	
	ФайлВХранилище = НЕ АдресВременногоХранилища = Неопределено;
	ФайлНаДиске = НЕ ИмяФайла = Неопределено;
	
	Если ФайлВХранилище Тогда
		ПутьНаСервере = ПолучитьИмяВременногоФайла();
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
		ДвоичныеДанные.Записать(ПутьНаСервере);
	ИначеЕсли ФайлНаДиске Тогда
		ПутьНаСервере = ИмяФайла;
		пФайл = Новый Файл(ПутьНаСервере);
		Если НЕ пФайл.Существует() Тогда
	    	Сообщить("Указанный файл не найден!");
			Возврат;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;

	лТаблица = ДанныеФормыВЗначение(Таблица, Тип("ТаблицаЗначений"));
    РедакторКолонок = ДанныеФормыВЗначение(ОписаниеКолонок, Тип("ТаблицаЗначений"));
	лТаблица.Очистить();
	лТаблица.Колонки.Очистить();
	РедакторКолонок.Очистить();

	Попытка
		ПолученноеЗначение = ЗначениеИзФайла(ПутьНаСервере);
	Исключение
	    Сообщить("Ошибка при получении файла! Описание: " + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Если ФайлВХранилище Тогда
		УдалитьФайлы(ПутьНаСервере);
	КонецЕсли;

	Если (НЕ ТипЗнч(ПолученноеЗначение) = Тип("ТаблицаЗначений")) 
		//ИЛИ (НЕ ТипЗнч(ПолученноеЗначение) = Тип("ДеревоЗначений")) 
		Тогда
		Сообщить("Загружаемый файл не является таблицей значений!");
		Возврат;
	КонецЕсли;
	
	лТаблица = ПолученноеЗначение;
	
	КолКол = Элементы.Таблица.ПодчиненныеЭлементы.Количество();
	МассивУдаляемыхРеквизитов = Новый Массив;
	Пока КолКол > 0 Цикл
		МассивУдаляемыхРеквизитов.Добавить("Таблица." + Элементы.Таблица.ПодчиненныеЭлементы[КолКол - 1].Имя);
		Элементы.Удалить(Элементы.Таблица.ПодчиненныеЭлементы[КолКол - 1]);
		КолКол = КолКол - 1;
	КонецЦикла; 
	ИзменитьРеквизиты(, МассивУдаляемыхРеквизитов); 
	
	ВывестиКолонкиВРедактор(РедакторКолонок, ПолученноеЗначение.Колонки);
	Для каждого Колонка Из ПолученноеЗначение.Колонки Цикл
		ДобавитьКолонку(Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла; 

	ЗначениеВДанныеФормы(лТаблица, Таблица);
    ЗначениеВДанныеФормы(РедакторКолонок, ОписаниеКолонок);
    
КонецПроцедуры

&НаКлиенте
Процедура СохранитьТаблицуВФайл(Команда)

	Режим = РежимДиалогаВыбораФайла.Сохранение;
    ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
    ДиалогОткрытияФайла.ПолноеИмяФайла = "";
    Текст = "ru = ""Текст""; en = ""Text""";
    Фильтр = НСтр(Текст)+"(*.txt)|*.txt";
    ДиалогОткрытияФайла.Фильтр = Фильтр;
    ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
    ДиалогОткрытияФайла.Заголовок = "Выберите файл";

	Если Объект.МодальностьРазрешена Тогда
		КодВыполнения = 
		"Если ДиалогОткрытияФайла.Выбрать() Тогда
		|	СохранитьТаблицуВФайлЗавершение(ДиалогОткрытияФайла.ПолноеИмяФайла, Неопределено);
		|КонецЕсли;";
	Иначе
		КодВыполнения = "
		|Оповещение = Новый ОписаниеОповещения(""СохранитьТаблицуВФайлЗавершение"", ЭтаФорма, Неопределено);
		|ДиалогОткрытияФайла.Показать(Оповещение);"; 
	КонецЕсли;
	
	Выполнить(КодВыполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьТаблицуВФайлЗавершение(Путь, Параметры) Экспорт
	
	Если Путь = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Путь) = Тип("Строка") Тогда
		пПутьКФайлу = Путь;
	ИначеЕсли ТипЗнч(Путь) = Тип("Массив") Тогда
		пПутьКФайлу = Путь[0];
	Иначе
		Сообщить("Ошибка в имени сохранении файла!");
	КонецЕсли; 
////////////////////////////////////////////////////////////
	Адрес = ПолучитьФайл_();
	Описание = Новый ОписаниеПередаваемогоФайла(пПутьКФайлу, Адрес);
	МассивОписаний = Новый Массив;
	МассивОписаний.Добавить(Описание);
	
	Если Объект.МодальностьРазрешена Тогда
		КодВыполнения = "
		|ПолучитьФайлы(МассивОписаний, , , Ложь);";
	Иначе
		КодВыполнения = "
		|Оповещение = Новый ОписаниеОповещения(""СохранениеФайлаНаДиск"", ЭтаФорма, Неопределено);
		|НачатьПолучениеФайлов(Оповещение, МассивОписаний, , Ложь);";
	КонецЕсли;
	
	Выполнить(КодВыполнения);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьФайл_()
	
	лТаблица = ДанныеФормыВЗначение(Таблица, Тип("ТаблицаЗначений"));
	
	ПутьНаСервере = ПолучитьИмяВременногоФайла();
	ЗначениеВФайл(ПутьНаСервере, лТаблица);

	Двоичное = Новый ДвоичныеДанные(ПутьНаСервере);
	Адрес = ПоместитьВоВременноеХранилище(Двоичное);
	УдалитьФайлы(ПутьНаСервере);
	Возврат Адрес;
	
КонецФункции

&НаСервере
Процедура СохранениеФайлаНаДиск(ПолученныеФайлы, Параметры) Экспорт
	// Не удалять!
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьКолонки(Команда)
	
	Режим =  НЕ Элементы.ФормаРедактироватьКолонки.Пометка;
	Элементы.ФормаРедактироватьКолонки.Пометка = Режим;
	Элементы.ГруппаРедактораКолонок.Видимость = Режим;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВОбъект(Команда)
    
	ПутьКФорме = ПолучитьИмяОбработки() + ".Форма.ФормаВыгрузкаВОбъект";
    ПараметрыОткрытия = Новый Структура;

    ПутьКХранилищу = "";
    ПередатьРезультат(ПутьКХранилищу);
    
    ПараметрыОткрытия.Вставить("ПутьКХранилищу", ПутьКХранилищу);
    
	//ОткрытьФормуМодально(ПутьКФорме, ПараметрыОткрытия);
	ОткрытьФорму(ПутьКФорме, ПараметрыОткрытия);
	//ОткрытьФормуАвтоматически("ФормаВыгрузкаВОбъект", ПараметрыОткрытия, "", Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТекстЗапросаКТЧ(Команда)
	
	ТЗ = "ТЗ";
	ИмяВТ = "ВТ";
	ТекствЫБРАТЬ = "ВЫБРАТЬ";
	ТекстПолей = "";
	
	Для каждого Строка Из ОписаниеКолонок Цикл
		ТекстПолей = ТекстПолей + ?(ТекстПолей = "", "", ",") + Символы.ПС + "	" + ТЗ + "." + Строка.ИмяКолонки; 
	КонецЦикла;
	
	ТекстХвоста = Символы.ПС + "ПОМЕСТИТЬ " + ИмяВТ + Символы.ПС + "ИЗ" + Символы.ПС + "	&" + ТЗ + " КАК " + ТЗ;
	
	ТекстЗапроса = ТекствЫБРАТЬ + ТекстПолей + ТекстХвоста;
	
	ТекстовыйДокумент.ДобавитьСтроку(ТекстЗапроса);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////
// ОРАБОТЧИКИ СОБЫТИЙ КОМАНДНОЙ ПАНЕЛИ МОДУЛЯ

&НаКлиенте
Процедура ВыполнитьКод(Команда)
	
	ВыполнитьКодСервер();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКодСервер()

	Результат = Таблица;
	Выполнить(ТекстовыйДокумент.ПолучитьТекст());
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТекстПроведенияДокументов(Команда)
	
	#Если НЕ ТолстыйКлиентУправляемоеПриложение Тогда
	ДопТекст = "	//Внимание! Консоль запущена не в режиме толстого клиента. 
	|	//Обработка прерывания пользователя не доступна.
	|	//ОбработкаПрерыванияПользователя();";
	#Иначе
	ДопТекст = "	ОбработкаПрерыванияПользователя();";
	#КонецЕсли

	Текст = 
	"Для каждого Строка из Результат Цикл
	|
	|" + ДопТекст + "
	|
	|	ДокОбъект = Строка.Ссылка.ПолучитьОбъект();
	|	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	|	Сообщить(""Записан документ ""+ ДокОбъект);
	|
	|КонецЦикла;";

	ТекстовыйДокумент.ДобавитьСтроку(Текст);	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТекстЦикла(Команда)
	
	#Если НЕ ТолстыйКлиентУправляемоеПриложение Тогда
	ДопТекст = "	//Внимание! Консоль запущена не в режиме толстого клиента. 
	|	//Обработка прерывания пользователя не доступна.
	|	//ОбработкаПрерыванияПользователя();";
	#Иначе
	ДопТекст = "	ОбработкаПрерыванияПользователя();";
	#КонецЕсли

	Текст = 
	"Для каждого Строка из Результат Цикл
	|
	|" + ДопТекст + "
	|
	|КонецЦикла;";

	ТекстовыйДокумент.ДобавитьСтроку(Текст);	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТекстПолученияУникальногоИдентификатора(Команда)
	
	#Если НЕ ТолстыйКлиентУправляемоеПриложение Тогда
	ДопТекст = "	//Внимание! Консоль запущена не в режиме толстого клиента. 
	|	//Обработка прерывания пользователя не доступна.
	|	//ОбработкаПрерыванияПользователя();";
	#Иначе
	ДопТекст = "	ОбработкаПрерыванияПользователя();";
	#КонецЕсли

	Текст = 
	"Для каждого Строка из Результат Цикл
	|
	|" + ДопТекст + "
	|
	|	пСсылка = Строка.Ссылка;
	|
	|	УИ = пСсылка.УникальныйИдентификатор();
	|	Сообщить(Строка(пСсылка.Ссылка) + "": "" + УИ);
	|
	|КонецЦикла;";

	ТекстовыйДокумент.ДобавитьСтроку(Текст);	

КонецПроцедуры

&НаКлиенте
Процедура СоздатьТекстПолученияУникальногоИдентификатора_ДобавитьКолонкуВТЗ(Команда)
	
	СоздатьКолонкуУИ();
	
	#Если НЕ ТолстыйКлиентУправляемоеПриложение Тогда
	ДопТекст = "	//Внимание! Консоль запущена не в режиме толстого клиента. 
	|	//Обработка прерывания пользователя не доступна.
	|	//ОбработкаПрерыванияПользователя();";
	#Иначе
	ДопТекст = "	//ОбработкаПрерыванияПользователя();";
	#КонецЕсли

	Текст = 
	"Для каждого Строка из Результат Цикл
	|
	|" + ДопТекст + "
	|
	|	пСсылка = Строка.Ссылка;
	|
	|	Строка.УИ = пСсылка.УникальныйИдентификатор();
	|	//Сообщить(Строка(пСсылка.Ссылка) + "": "" + УИ);
	|
	|КонецЦикла;";

	ТекстовыйДокумент.ДобавитьСтроку(Текст);	

КонецПроцедуры

&НаСервере
Процедура СоздатьКолонкуУИ()

	Табл = РеквизитФормыВЗначение("Таблица");
	Если Табл.Колонки.Найти("УИ") = Неопределено Тогда
		ДобавитьКолонку("УИ", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(36)));
	КонецЕсли; 

КонецПроцедуры // ПроверитьНаличиеКолонки()

&НаКлиенте
Процедура СоздатьТекстОбработкиДвиженийРегистраБухгалтерии(Команда)
	
	#Если НЕ ТолстыйКлиентУправляемоеПриложение Тогда
	ДопТекст = "	//Внимание! Консоль запущена не в режиме толстого клиента. 
	|	//Обработка прерывания пользователя не доступна.
	|	//ОбработкаПрерыванияПользователя();";
	#Иначе
	ДопТекст = "	ОбработкаПрерыванияПользователя();";
	#КонецЕсли

	Текст = 
	"Для каждого Строка из Результат Цикл
	|
	|" + ДопТекст + "
	|
	|//	НаборЗаписей = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
	|//	НаборЗаписей.Отбор.Регистратор.Установить(Строка.Ссылка);
	|//	НаборЗаписей.Прочитать();   
	|//	
	|//	Если НаборЗаписей.Количество() = 0 Тогда
	|//		Возврат;
	|//	КонецЕсли;
	|//	
	|//	Для каждого Запись из НаборЗаписей Цикл
	|//		
	|//		Если Запись.СчетДт.НалоговыйУчет Тогда
	|//			Запись.СуммаНУДт = Запись.Сумма;
	|//		КонецЕсли;
	|//		Если Запись.СчетКт.НалоговыйУчет Тогда
	|//			Запись.СуммаНУКт = Запись.Сумма;
	|//		КонецЕсли;
	|//		
	|//	КонецЦикла;
	|//	
	|//	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	|//	НаборЗаписей.Записать();
	|//	
	|//	ДокументОбъект = Строка.Ссылка.ПолучитьОбъект();
	|//	ДокументОбъект.ОбменДанными.Загрузка = Истина;
	|//	ДокументОбъект.РучнаяКорректировка   = Истина;
	|//	ДокументОбъект.Комментарий   = ""#Добавлено подразделение внешней обработкой. "" + ДокументОбъект.Комментарий;
	|//	ДокументОбъект.Записать();
	|
	|КонецЦикла;";

	ТекстовыйДокумент.ДобавитьСтроку(Текст);	

КонецПроцедуры
 
&НаКлиенте
Процедура ОчиститьТекстМодуля(Команда)
	
	ТекстовыйДокумент.Очистить();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////
// ОРАБОТЧИКИ СОБЫТИЙ НИЖНЕЙ КОМАНДНОЙ ПАНЕЛИ ФОРМЫ

&НаКлиенте
Процедура ОК(Команда)
	
	ПутьКХранилищу = Неопределено;
	ПередатьРезультат(ПутьКХранилищу);
	Закрыть(ПутьКХранилищу);

КонецПроцедуры

&НаСервере
Процедура ПередатьРезультат(ПутьКХранилищу)
    
	лТаблица = ДанныеФормыВЗначение(Таблица, Тип("ТаблицаЗначений"));
	пХранилище = ПолучитьИзВременногоХранилища(Параметры.ОбъектПутьКХранилищу);
	
	ТаблицаПакетов = пХранилище.ТаблицаПакетов;
	
	Если НЕ ПустаяСтрока(Параметры.ПараметрАдрес) Тогда
		
		Отбор = Новый Структура("Адрес", Параметры.ПараметрАдрес);
		МассивСтрок = ТаблицаПакетов.НайтиСтроки(Отбор);
		Если МассивСтрок.Количество() = 0 Тогда
			Возврат;
		Иначе
			Строка = МассивСтрок[0];
			Строка.ТекстМодуля = ТекстовыйДокумент.ПолучитьТекст();
		КонецЕсли; 
		
	КонецЕсли;
	
	Если Параметры.ОтборПараметрЗапроса <> Неопределено Тогда
		
		ТабПараметров = пХранилище.ТабПараметров;
		
		Строкапараметра = ТабПараметров.НайтиСтроки(Параметры.ОтборПараметрЗапроса)[0];
		
		Строкапараметра.Значение = лТаблица;
		//Возврат;
	
	КонецЕсли;
	
	ПутьКХранилищу = ПоместитьВоВременноеХранилище(лТаблица);
    
КонецПроцедуры // ПередатьРезультат()

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////
// ОРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОЙ ЧАСТИ РЕДАКТОРА КОЛОНОК

&НаКлиенте
Процедура ОписаниеКолонокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Копирование Тогда
	
		Элемент.ТекущиеДанные.ИсходноеИмяКолонки = "";
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеКолонокПередУдалением(Элемент, Отказ)
	
	ТекущаяСтрока = ОписаниеКолонок.НайтиПоИдентификатору(Элементы.ОписаниеКолонок.ТекущаяСтрока);
	УдалитьКолонку(ТекущаяСтрока.ИмяКолонки, ТекущаяСтрока.ИсходноеИмяКолонки);
	ОписаниеКолонок.Удалить(ОписаниеКолонок.НайтиПоИдентификатору(ТекущаяСтрока.ПолучитьИдентификатор()));
	
КонецПроцедуры

&НаСервере
Процедура УдалитьКолонку(Имя, ИсходноеИмяКолонки)

	Если ИсходноеИмяКолонки = "" Тогда
		Возврат;
	КонецЕсли; 

	ИмяПоиска = ?(ИсходноеИмяКолонки = "", Имя, ИсходноеИмяКолонки);
	
    лТаблица = ДанныеФормыВЗначение(Таблица, Тип("ТаблицаЗначений"));
    Колонка = лТаблица.Колонки.Найти(ИмяПоиска);
	КолонкиНет = Колонка = Неопределено;
	Если КолонкиНет Тогда
         Возврат;
	КонецЕсли; 
	ЗначениеВДанныеФормы(лТаблица, Таблица);
	
	
	МассивУдаляемыхРеквизитов = Новый Массив;
	МассивУдаляемыхРеквизитов.Добавить("Таблица." + ИсходноеИмяКолонки);
	ИзменитьРеквизиты(, МассивУдаляемыхРеквизитов); 

	УдаляемыйЭлемент = Элементы.Найти(ИсходноеИмяКолонки);
	Элементы.Удалить(УдаляемыйЭлемент);

КонецПроцедуры 

&НаКлиенте
Процедура ОписаниеКолонокПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)

	ТекущаяСтрока = Элементы.ОписаниеКолонок.ТекущаяСтрока;
	РедактироватьКолонку(ТекущаяСтрока, Отказ);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////
// ДОПОЛНИТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ВывестиКолонкиВРедактор(РедакторКолонок, Колонки)

    РедакторКолонок.Очистить();
    Для каждого Колонка Из Колонки Цикл
    
    	НоваяСтрока = РедакторКолонок.Добавить();
        НоваяСтрока.ИмяКолонки = Колонка.Имя;
        НоваяСтрока.ТипДанных = Колонка.ТипЗначения;
        НоваяСтрока.ИсходноеИмяКолонки = Колонка.Имя;
    
    КонецЦикла; 
    
КонецПроцедуры // ВывестиКолонкиВРедактор()

&НаСервере
Процедура ДобавитьКолонку(Имя, ТипЗначения)

	МассивДобавляемыхРеквизитов = Новый Массив;
	РеквизитФормы = Новый РеквизитФормы(Имя, ТипЗначения, "Таблица", Имя); 
	МассивДобавляемыхРеквизитов.Добавить(РеквизитФормы); 
	ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	
	Элемент = Элементы.Добавить(Имя, Тип("ПолеФормы"), Элементы.Таблица); 
	Элемент.ПутьКДанным = "Таблица." + Имя;
	Элемент.Вид = ВидПоляФормы.ПолеВвода;

КонецПроцедуры

&НаСервере
Процедура РедактироватьКолонку(ТекущаяСтрока, Отказ)

	ТекСтрока = ОписаниеКолонок.НайтиПоИдентификатору(ТекущаяСтрока);
	Отбор = Новый Структура("ИмяКолонки,ТипДанных,ИсходноеИмяКолонки", ТекСтрока.ИмяКолонки, ТекСтрока.ТипДанных, ТекСтрока.ИсходноеИмяКолонки);
	
	пОписаниеКолонок = РеквизитФормыВЗначение("ОписаниеКолонок", Тип("ТаблицаЗначений"));
	пТекСтрока = пОписаниеКолонок.НайтиСтроки(Отбор)[0];
	
	Имя                = пТекСтрока.ИмяКолонки;
	ТипЗначения        = пТекСтрока.ТипДанных;
	ИсходноеИмяКолонки = пТекСтрока.ИсходноеИмяКолонки;

	Для каждого пСтрока Из пОписаниеКолонок Цикл
		
		Если пОписаниеКолонок.Индекс(пСтрока) = пОписаниеКолонок.Индекс(пТекСтрока) Тогда
			Продолжить;
		КонецЕсли;
		
		Если пСтрока.ИмяКолонки = пТекСтрока.ИмяКолонки Тогда
			пТекСтрока.ИмяКолонки = пТекСтрока.ИмяКолонки + "_";
			Сообщить("Отказ! Такое имя поля уже есть!");
			Отказ = Истина;
			Возврат;
		КонецЕсли; 
	
	КонецЦикла; 

	ИмяПоиска = ?(ИсходноеИмяКолонки = "", Имя, ИсходноеИмяКолонки);
	
    лТаблица = ДанныеФормыВЗначение(Таблица, Тип("ТаблицаЗначений"));
    Колонка = лТаблица.Колонки.Найти(ИмяПоиска);
	КолонкиНет = Колонка = Неопределено;
	Если НЕ КолонкиНет Тогда
		ИсходныеДанныеКолонки = лТаблица.ВыгрузитьКолонку(Колонка);
	КонецЕсли; 
	ЗначениеВДанныеФормы(лТаблица, Таблица);
	
	Если КолонкиНет Тогда
        МассивДобавляемыхРеквизитов = Новый Массив;
		РеквизитФормы = Новый РеквизитФормы(Имя, ТипЗначения, "Таблица", Имя); 
		МассивДобавляемыхРеквизитов.Добавить(РеквизитФормы); 
        ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
        
        Элемент = Элементы.Добавить(Имя, Тип("ПолеФормы"), Элементы.Таблица); 
        Элемент.ПутьКДанным = "Таблица." + Имя;
        Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Иначе
		
		Если (Колонка.ТипЗначения = ТипЗначения) И (ИсходноеИмяКолонки = Имя) Тогда
			Возврат;
		КонецЕсли;
		
		ИзменилсяТип = НЕ Колонка.ТипЗначения = ТипЗначения;
		ИзменилосьИмя = НЕ ИсходноеИмяКолонки = Имя;
		
		Если НЕ ИзменилосьИмя Тогда
			
			МассивУдаляемыхРеквизитов = Новый Массив;
			МассивУдаляемыхРеквизитов.Добавить("Таблица." + ИсходноеИмяКолонки);
			ИзменитьРеквизиты(, МассивУдаляемыхРеквизитов); 
			
			МассивДобавляемыхРеквизитов = Новый Массив;
			РеквизитФормы = Новый РеквизитФормы(Имя + "_", ТипЗначения, "Таблица", Имя + "_"); 
			МассивДобавляемыхРеквизитов.Добавить(РеквизитФормы);
			ИзменитьРеквизиты(МассивДобавляемыхРеквизитов, ); 
			
			УдаляемыйЭлемент = Элементы.Найти(ИсходноеИмяКолонки);
			
			Элемент = Элементы.Вставить(Имя + "_", Тип("ПолеФормы"), Элементы.Таблица, УдаляемыйЭлемент); 
			Элемент.ПутьКДанным = "Таблица." + Имя + "_";
			Элемент.Вид = ВидПоляФормы.ПолеВвода;
			
			Элементы.Удалить(УдаляемыйЭлемент);
			
			ИсходноеИмяКолонки = Имя + "_";
			
		КонецЕсли;
		
		МассивУдаляемыхРеквизитов = Новый Массив;
		МассивУдаляемыхРеквизитов.Добавить("Таблица." + ИсходноеИмяКолонки);
		ИзменитьРеквизиты(, МассивУдаляемыхРеквизитов); 
		
		МассивДобавляемыхРеквизитов = Новый Массив;
		РеквизитФормы = Новый РеквизитФормы(Имя, ТипЗначения, "Таблица", Имя); 
		МассивДобавляемыхРеквизитов.Добавить(РеквизитФормы);
		ИзменитьРеквизиты(МассивДобавляемыхРеквизитов, ); 

		УдаляемыйЭлемент = Элементы.Найти(ИсходноеИмяКолонки);
		
		Элемент = Элементы.Вставить(Имя, Тип("ПолеФормы"), Элементы.Таблица, УдаляемыйЭлемент); 
		Элемент.ПутьКДанным = "Таблица." + Имя;
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		
		Элементы.Удалить(УдаляемыйЭлемент);
        
		лТаблица = ДанныеФормыВЗначение(Таблица, Тип("ТаблицаЗначений"));
		Колонка = лТаблица.Колонки.Найти(Имя);
		лТаблица.ЗагрузитьКолонку(ИсходныеДанныеКолонки, Колонка);
		ЗначениеВДанныеФормы(лТаблица, Таблица);
		
	КонецЕсли;
	
	пТекСтрока.ИсходноеИмяКолонки = пТекСтрока.ИмяКолонки;
	ЗначениеВДанныеФормы(пОписаниеКолонок, ОписаниеКолонок);

КонецПроцедуры // РедактироватьКолонку()

&НаКлиенте
Функция ПолучитьПутьСохраненияФайла()
    
    Режим = РежимДиалогаВыбораФайла.Сохранение;
    ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
    ДиалогОткрытияФайла.ПолноеИмяФайла = "";
    Текст = "ru = ""Текст""; en = ""Text""";
    Фильтр = НСтр(Текст)+"(*.txt)|*.txt";
    ДиалогОткрытияФайла.Фильтр = Фильтр;
    ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
    ДиалогОткрытияФайла.Заголовок = "Выберите файл";
    Если ДиалогОткрытияФайла.Выбрать() Тогда
        Возврат ДиалогОткрытияФайла.ПолноеИмяФайла;
    Иначе
        Возврат Неопределено;
    КонецЕсли;
    
КонецФункции // ПолучитьПутьСохраненияФайла()

&НаКлиенте
Функция ПолучитьПутьЗагружаемогоФайла()
    
    Режим = РежимДиалогаВыбораФайла.Открытие;
    ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
    ДиалогОткрытияФайла.ПолноеИмяФайла = "";
    Текст = "ru = ""Текст""; en = ""Text""";
    Фильтр = НСтр(Текст)+"(*.txt)|*.txt";
    ДиалогОткрытияФайла.Фильтр = Фильтр;
    ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
    ДиалогОткрытияФайла.Заголовок = "Выберите файл";
    Если ДиалогОткрытияФайла.Выбрать() Тогда
        Возврат ДиалогОткрытияФайла.ПолноеИмяФайла;
    Иначе
        Возврат Неопределено;
    КонецЕсли;
    
КонецФункции // ПолучитьПутьСохраненияФайла()

&НаСервере
Функция ПолучитьИмяОбработки()
	
	Возврат РеквизитФормыВЗначение("Объект").Метаданные().ПолноеИмя();
	
КонецФункции 


