
&НаКлиенте
Процедура ОтключитьЗапросИнтернетПоддержки(Команда)
	
    ОтключитьИнтернетПоддержкуУВсехПользователейНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьИнтернетПоддержкуУВсехПользователейНаСервере()
                                                                           
    МассивПользователей = ПользователиИнформационнойБазы.ПолучитьПользователей();
	ОтключенаНастройка = Ложь;
	Для Каждого Пользователь Из МассивПользователей Цикл
        ЗначениеНастройки = ХранилищеОбщихНастроек.Загрузить("ИнтернетПоддержкаПользователей", "ВсегдаПоказыватьПриСтартеПрограммы", , Пользователь.Имя);	
		Если ЗначениеНастройки <> Ложь Тогда
			ХранилищеОбщихНастроек.Сохранить("ИнтернетПоддержкаПользователей", "ВсегдаПоказыватьПриСтартеПрограммы", Ложь, , Пользователь.Имя);
			ТекстСообщения = СтрШаблон("Для пользователя %1 интернет-поддержка отключена", Пользователь.Имя);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , ОтключенаНастройка);
		КонецЕсли;
    КонецЦикла;
	
	Если НЕ ОтключенаНастройка Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Настройка уже сохранена для всех пользователей");
	КонецЕсли;
	
КонецПроцедуры